# Assignment : 22(23rd Feb'2023)

1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
import pandas as pd
my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
my_series = pd.Series(my_list)
print(my_series)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

3. Create a Pandas DataFrame that contains the following data:

|Name|Age|Gender|
|--|--|--|
|Alice|25|Female|
|Bob| 30|Male|
|Claire|27|Female|

Then, print the DataFrame..

In [17]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4. What is `DataFrame` in pandas and how is it different from `pandas.series`? Explain with an example.

|Pandas Series | Pandas DataFrame|
|-|-|
|One-dimensional|Two-dimensional|
|Homogenous – Series elements must be of the same data type.|Heterogenous – DataFrame elements can have different data types.|
|Size-immutable – Once created, the size of a Series object cannot be changed|Size-mutable – Elements can be dropped or added in an existing DataFrame.| 

**Note :** A Pandas `DataFrame` is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [21]:
import pandas as pd
# create a Pandas Series
series = pd.Series([10, 20, 30, 40, 50], name='Numbers')
series

0    10
1    20
2    30
3    40
4    50
Name: Numbers, dtype: int64

In [19]:
# create a Pandas DataFrame with two columns
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45]
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
* Read data
* Head & Tail
* Shape, Size & Info
* Describe
* Value Counts

In [33]:
import pandas as pd
df = pd.read_csv('departments.csv')
df.head(3)

   DEPARTMENT_ID DEPARTMENT_NAME MANAGER_ID  LOCATION_ID
0             10  Administration        200         1700
1             20       Marketing        201         1800
2             30      Purchasing        114         1700

In [34]:
df.head(4)

   DEPARTMENT_ID  DEPARTMENT_NAME MANAGER_ID  LOCATION_ID
0             10   Administration        200         1700
1             20        Marketing        201         1800
2             30       Purchasing        114         1700
3             40  Human Resources        203         2400

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   DEPARTMENT_ID    27 non-null     int64
 1   DEPARTMENT_NAME  27 non-null     object
 2   MANAGER_ID       27 non-null     object
 3   LOCATION_ID      27 non-null     int64
dtypes: int64(2), object(2)
memory usage: 992.0+ bytes

In [30]:
df.shape,df.size

((27, 4), 108)

In [36]:
df.describe()

       DEPARTMENT_ID  LOCATION_ID
count      27.000000    27.000000
mean      140.000000  1777.777778
std        79.372539   284.650033
min        10.000000  1400.000000
25%        75.000000  1700.000000
50%       140.000000  1700.000000
75%       205.000000  1700.000000
max       270.000000  2700.000000

In [43]:
df[['LOCATION_ID']].value_counts()

LOCATION_ID
1700           21
1400            1
1500            1
1800            1
2400            1
2500            1
2700            1
dtype: int64

6. Which of the following is mutable in nature Series, DataFrame, Panel?
* In Pandas, Series and DataFrame are mutable in nature while Panel is considered immutable.
* However, **Panel** can be converted to a mutable DataFrame using the `to_frame()` function, which allows the DataFrame to be modified.

7. Create a DataFrame using multiple Series. Explain with an example.

In [48]:
import pandas as pd

names = pd.Series(['Alice', 'Bob', 'Charlie', 'David', 'Emily'])
ages = pd.Series([18, 19, 20, 21, 22])
marks = pd.Series([90, 85, 95, 80, 87])
students_df = pd.DataFrame({'Name': names, 'Age': ages, 'Marks': marks})
students_df

      Name  Age  Marks
0    Alice   18     90
1      Bob   19     85
2  Charlie   20     95
3    David   21     80
4    Emily   22     87